
def perimeter(a, b):
	''' 
    Возвращает периметр прямоугольника в виде десятичного числа.
        
            Параметры:
                    a (число): первое десятичное число
                    b (число): второе десятичное число

            Возвращаемое число:
                    rectangle_perimeter (число): десятичное число, периметр прямоугольника - сумма a и b умноженная на 2
    '''
	return (a + b) * 2


def area(a, b):
	''' 
    Возвращает площадь прямоугольника в виде десятичного числа.
        
            Параметры:
                    a (число): первое десятичное число
                    b (число): второе десятичное число

            Возвращаемое число:
                    rectangle_area (число): десятичное число, площадь прямоугольника - a умноженное на b
    '''
	return a * b
