
def area(a):
    ''' 
    Возвращает площадь квадрата в виде десятичного числа.
        
            Параметры:
                    a (число): десятичное число

            Возвращаемое число:
                    square_area (число): десятичное число, площадь квадрата - a умноженное на a
    '''
    return a * a


def perimeter(a):
    ''' 
    Возвращает периметр квадрата в виде десятичного числа.
        
            Параметры:
                    a (число): десятичное число

            Возвращаемое число:
                    square_perimeter (число): десятичное число, периметр квадрата - a умноженное на 4
    '''
    return 4 * a
