
def area(a, height):
    ''' 
    Возвращает периметр треугольника в виде десятичного числа.
        
            Параметры:
                    a (число): первое десятичное число
                    height (число): второе десятичное число

            Возвращаемое число:
                    treangle_area (число): десятичное число, площадь треугольника - произведение a и height деленное на 2
    '''
    return a * height / 2


def perimeter(a, b, c):
    ''' 
    Возвращает периметр треугольника в виде десятичного числа.
        
            Параметры:
                    a (число): первое десятичное число
                    b (число): второе десятичное число
                    c (число): третье десятичное число 

            Возвращаемое число:
                    treangle_perimeter (число): десятичное число, периметр треугольника - сумма a, b и c
    '''
    return a + b + c
